<?php

use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

return new class extends Migration
{
    /**
     * Run the migrations.
     */
    public function up(): void
    {
        Schema::table('products_dictionary', function (Blueprint $table) {
            $table->boolean('always_show')->default(false);
        });
        /**
         * 1.	Зефир "Жизель" с вареной сгущенкой глазированный с ароматом ванили 2,5кг, кг
         * 2.	Зефир "Жизель" с фруктовой начинкой глазированный с ароматом ванили 2,5кг, кг
         * 3.	Зефир "Жизель" глазированный с ароматом ванили 2,5кг, кг
         * 4.	Зефир "Жизель" в йогуртовой глазури с ароматом ванили 2,5кг, кг
         * 5.	Зефир "Жизель" с "вареной сгущенкой" в йогуртовой глазури с ароматом ванили 2,5кг, кг
         * 6.	Зефир "Жизель" с фруктовой начинкой в йогурт. гл. с ароматом ванили 2,5 кг, кг
         * 7.	Зефир "Бело-розовый" с ароматом ванили и малины 4,5 кг, кг
         * 8.	Зефир "Бело-розовый" с ароматом ванили и малины в индивид. упаковке 4 кг (форма цветок)
         * 9.	Зефир "Жизель" со вкусом творога 4,0 кг, кг
         * 10.	Зефир "Жизель" с ароматом ванили 4,5 кг, кг
         * 11.	Зефир "Жизель" с ароматом ванили в индивид. прозрачной упаковке 4кг, кг
         * 12.	Зефир "Жизель" с ароматом крем-брюле 4,5 кг, кг
         * 13.	Зефир "Жизель" с ароматом крем-брюле в индивид. прозрачной упаковке 4кг, кг
         * 14.	Зефир "Жизель" с фруктовой начинкой с ароматом малины в индивид. прозрачной упаковке 4кг, кг
         * 15.	Зефир "Жизель" с фруктовой начинкой со вкусом мандарина 4,5кг, кг
         * 16.	Зефир "Жизель" со вкусом яблока 4 кг, кг
         * 17.	Зефир "Сокол" с фруктовой начинкой с ароматом малины 4,5кг, кг
         * 18.	Зефир «Жизель» клюквенный 4,0 кг , кг

         */
    }

    /**
     * Reverse the migrations.
     */
    public function down(): void
    {
        Schema::table('products_dictionary', function (Blueprint $table) {
            $table->dropColumn('always_show');
        });
    }
};
